src/cf/Documents/fmItemDepedenciesSetting.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>fmItemDepedenciesSetting</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.fmItemsDependencies</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Scenario</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmBudgetingScenarios</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Item</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmIncomesAndExpensesItems</v8:Type>
						<v8:Type>cfg:CatalogRef.fmCashflowItems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Analytics1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.fmAnalyticsTypes</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Analytics2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.fmAnalyticsTypes</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Analytics3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.fmAnalyticsTypes</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmDependenciesSettingOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BalanceUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmBalanceUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>DependentItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Item</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmIncomesAndExpensesItems</v8:Type>
								<v8:Type>cfg:CatalogRef.fmCashflowItems</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Percent</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Analytics1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.fmAnalyticsTypes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Analytics2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.fmAnalyticsTypes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Analytics3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.fmAnalyticsTypes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DependentAnalyticsFillingVariant1</Name>
							<Type>
								<v8:Type>cfg:EnumRef.fmDependentAnalyticsFillingVariants</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DependentAnalyticsFillingVariant2</Name>
							<Type>
								<v8:Type>cfg:EnumRef.fmDependentAnalyticsFillingVariants</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DependentAnalyticsFillingVariant3</Name>
							<Type>
								<v8:Type>cfg:EnumRef.fmDependentAnalyticsFillingVariants</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AlloctionByPeriodsProfile</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmAlloctionByPeriodsProfiles</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MovementOperationType</Name>
							<Type>
								<v8:Type>cfg:EnumRef.fmBudgetFlowOperationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/fmItemDepedenciesSetting/Forms/AnalyticsSettingForm/Ext/Form/Module.bsl
&AtClient
Procedure Analytics2StartChoice(Item, ChoiceData, StandardProcessing)
	Items[Item.Name].ChoiceParameters = New FixedArray(New Array());
	If ValueIsFilled(Analytics1) AND TypeOf(Analytics1) = Type("CatalogRef.fmCounterparties") Then
		NewParameter = New ChoiceParameter("Filter.Owner", Analytics1);
		NewArray = New Array();
		NewArray.Add(NewParameter);
		NewParameters = New FixedArray(NewArray);
		Items[Item.Name].ChoiceParameters = NewParameters;
	EndIf;
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Analytics1 = Parameters.Analytics1;
	Analytics2 = Parameters.Analytics2;
	Analytics3 = Parameters.Analytics3;
	For Num=1 To 3 Do
		If ValueIsFilled(Parameters.ItemSetting["AnalyticsType"+Num]) AND Parameters.AnalyticsAreKnown Then
			Items["Analytics"+Num].TypeRestriction = Parameters.ItemSetting["AnalyticsType"+Num];
		Else
			Items["Analytics"+Num].Enabled = False;
		EndIf;
	EndDo;
EndProcedure

&AtClient
Procedure OK(Command)
	Notify("IEAnalytics", New Structure("Analytics1, Analytics2, Analytics3", Analytics1, Analytics2, Analytics3));
	Close();
EndProcedure
